import { TaskItem } from "@/types/tasks";

export const DEFAULT_TASKS: TaskItem[] = [
	{ id: "snacks", label: "خوراکی میارم " },
	{ id: "chairs", label: "صندلی یا وسیله برای نشستن میتون جور کنم" },
	{
		id: "pillows",
		label: "پتو یا بالشت و وسیله خواب میتونم جور کنم برای اونایی که وسط ایونت خواب میرن :/",
	},
	{ id: "drinks", label: "نوشیدنی میارم" },
	{ id: "liquor", label: "نوشیدنی میارم!" },
	{ id: "screens", label: "پروژکتور میتونم جور کنم" },
	{ id: "boardgame", label: "برودگیم میارم" },
	{ id: "console", label: "کنسول میارم" },
	{ id: "cable", label: "کابل Lan و مودم میارم CS بزنیم" },
	{
		id: "other",
		label: "غیره (هر چی که فک میکنید به قشنگ تر شدن خاطره کمک میکنه)",
	},
];

export const LANDING_COPY = {
	title: "TGA Watch Party ",
	subtitle: `
	گفتم گروه بزنم و همه رو ادد کنم ، بعد دیدم من که اصن گروه رو چک نمیکنم چه برسه اصن بخوام گروه بزنم و اونجا حرف بزنم. که خب گفتم این کار رو کنم سلام ! نمیدونم یادتونه یا نه ، دعوتید که شب The game award امسال بیاید جای من تا به این بهونه کمی دور هم باشیم. من همیشه دوست داشتم یه بار TGA رو دست جمعی ببینم و گفت چی بهتر از اینکه با هم انجامش بدیم
میدونم احتمالا نمیتونید ساعت ۴ تا ۶ صبح بیرون باشید ولی اگه شب قبلش بیاید و دور هم باشیم ، بوردگیم بازی کنیم ، COOP بزنیم یا هرچی ترتیب شام رو من سعی میکنم بدم پس خبرم کنید میاید یا نه. واینکه جای من زیاد وسیله برای پذیرایی و مهمونی نیست درنتیجه میخواستم بگم لطفا هر کسی که میتونه کاری بکنه و چیزی جور کنه که دور هم بیشتر راحت باشیم و بهتر خوشبگذره چه عالی . اخه در نهایت مثل همیشه
	`,

	cta: "The door is open but the ride ain't free",
};

export const EVENT_TIME = "2025-12-12T12:00:00-03:30";

export const SUBMISSION_LIST_DETAILS = {
	title: "تا الان",
	subtitle: "کی چی رو تا الان گردن گرفته",
	onEmpty: "💔 خالیه فعلا",
};
