import { TaskItem } from "@/types/tasks";

export const DEFAULT_TASKS: TaskItem[] = [
	{ id: "snacks", label: "خوراکی میارم " },
	{ id: "chairs", label: "صندلی یا وسیله برای نشستن میتون جور کنم" },
	{
		id: "pillows",
		label: "پتو یا بالشت و وسیله خواب میتونم جور کنم برای اونایی که وسط ایونت خواب میرن :/",
	},
	{ id: "drinks", label: "نوشیدنی میارم" },
	{ id: "liquor", label: "نوشیدنی میارم!" },
	{ id: "screens", label: "پروژکتور میتونم جور کنم" },
	{ id: "boardgame", label: "برودگیم میارم" },
	{ id: "console", label: "کنسول میارم" },
	{ id: "cable", label: "کابل Lan و مودم میارم CS بزنیم" },
	{
		id: "other",
		label: "غیره (هر چی که فک میکنید به قشنگ تر شدن خاطره کمک میکنه)",
	},
];

export const LANDING_COPY = {
	title: "TGA Watch Party ",
	subtitle:
		" امسال شب رویداد The Game Awards خوشحال میشم بیاید جای من جمع شیم و رویداد رو ببینیم . حتی اگه نمیتونید بمونید تا خود رویداد رو ببینیم بیاید تا شب قبلش دور هم باشیم . شامش هم با منه و ترتیبش رو رو میدم میتونیم بوردگیم بازی کنیم یا بازی های COOP بزنیم یا هم در مورد بازی های امسال TGA صحبت کنیم. اگر هم هستید که خود رویداد رو ببینیم لایو چه عالی! تنها مسئله اینه که با اینکه خیلی دوست دارم تمام و کمال ازتون پذیرایی کنم ولی  من جای خودم فقط یه میز و یه صندلی و یه تشک دارم و برای راحتی خودتون یکم باید کمک کنید . درنهایت مثل همیشه  ",
	cta: "The door is open but the ride ain't free",
};

export const EVENT_TIME = "2025-12-12T04:00:00-03:30";

export const SUBMISSION_LIST_DETAILS = {
	title: "تا الان",
	subtitle: "کی چی رو تا الان گردن گرفته",
	onEmpty: "💔 خالیه فعلا",
};
